week = ('понедельник','вторник','среда','четверг','пятница', 'суббота', 'воскресенье')
day = int (input ("введите номер дня недели: "))
if day > 0 and day < 8 :
    if (week[day - 1] == week[5]) or (week[day - 1] == week[6]) :
        print(week[day-1],'выходной')
    else:
        print (week[day-1])
else:
    print ('Try one more time')

#######################################################################################

print('Определение принаддлежности точки к четверти')
x = int( input('введите x: '))
y = int( input('введите y: '))
if x == 0 or y == 0 :
    print('ноль вводить нельзя')
    exit()
elif x>0 and y>0 :
    print ('точка принадлежит к 1 четверти')
elif x<0 and y>0 :
    print ('точка принадлежит к 2 четверти')
elif x<0 and y<0 :
    print ('точка принадлежит к 3 четверти')
else: 
    print ('точка принадлежит к 4 четверти')
    
#######################################################################################

print('Определение принаддлежности четверти к точкам')
chetvert = int( input('введите номер четверти от 1 до 4 : '))
if chetvert>0 and chetvert<5 :
    if chetvert == 1 :
        print ('к 1 четверти принадлежат точки с координатами x>0 и y>0')
    elif chetvert == 2 :
        print ('к 2 четверти принадлежат точки с координатами x<0 и y>0')
    elif chetvert == 3 :
        print ('к 3 четверти принадлежат точки с координатами x<0 и y<0')
    else : 
        print ('к 4 четверти принадлежат точки с координатами x>0 и y<0')
else:
    print ('такой четверти у круга нет')

###################################################################################

import math
print('Введите координаты первой точки')
x1 = int( input('введите x1: '))
y1 = int( input('введите y1: '))
print('Введите координаты второй точки')
x2 = int( input('введите x2: '))
y2 = int( input('введите y2: '))
L = math.pow((x2 - x1), 2) + math.pow((y2 - y1), 2)
print('расстояние между точками равно = ', math.sqrt(L))

################################################################################